


a1 = [['ИЗО', 'Физическая культура', 'Литература', 'Русский язык'], ['Музыка', 'Литература', 'Русский язык', 'Математика'], ['Русский язык', 'Физическая культура', 'Окружающий мир', 'Математика'], ['Физическая культура', 'Литеатурное чтение', 'Русский язык', 'Математика'], ['Литеатурное чтение', 'Русский язык', 'Математика', 'Окружающий мир', 'Труд']]
b1 = [['Литеатурное чтение', 'ИЗО', 'Физическая культура', 'Русский язык'], ['Литеатурное чтение', 'Музыка', 'Русский язык', 'Математика'], ['Физическая культура', 'Окружающий мир', 'Русский язык', 'Математика'], ['Литеатурное чтение', 'Русский язык', 'Физическая культура', 'Математика'], ['Литеатурное чтение', 'Труд', 'Русский язык', 'Математика', 'Окружающий мир']]
c1 = [['Физическая культура', 'Литеатурное чтение', 'ИЗО', 'Русский язык'], ['Литеатурное чтение', 'Русский язык', 'Музыка', 'Математика'], ['Окружающий мир', 'Математика', 'Русский язык', 'Физическая культура', 'Труд'], ['Русский язык', 'Физическая культура', 'Литеатурное чтение', 'Математика'], ['Окружающий мир', 'Литеатурное чтение', 'Русский язык', 'Математика']]

a2 = [['Литеатурное чтение', 'Английский язык', 'Русский язык', 'Окружающий мир'], ['Физическая культура', 'Литеатурное чтение', 'Русский язык', 'Музыка', 'Математика'], ['ИЗО', 'Русский язык', 'Английский язык', 'Математика', 'Литеатурное чтение'], ['Физическая культура', 'Русский язык', 'Литеатурное чтение', 'Математика', 'Окружающий мир'], ['Русский язык', 'Физическая культура', 'Труд', 'Математика']]
b2 = [['Математика', 'Русский язык', 'Английский язык', 'Литеатурное чтение'], ['Русский язык', 'Физическая культура', 'Литеатурное чтение', 'Окружающий мир', 'Музыка'], ['ИЗО', 'Английский язык', 'Русский язык', 'Математика'], ['Русский язык', 'Труд', 'Литеатурное чтение' ,'Математика'], ['Литеатурное чтение', 'Русский язык', 'Математика', 'Физическая культура', 'Окружающий мир']]
c2 = [['Английский язык', 'Литеатурное чтение', 'Русский язык', 'Окружающий мир'], ['Литеатурное чтение', 'Русский язык', 'Физическая культура', 'Математика'], ['Английский язык', 'Русский язык', 'ИЗО', 'Математика'], ['Музыка', 'Литеатурное чтение', 'Русский язык', 'Физическая культура', 'Математика'], ['Окружающий мир', 'Литеатурное чтение', 'Русский язык', 'Математика', 'Физическая культура']]

a3 = [['Математика', 'Литеатурное чтение', 'Русский язык', 'Музыка'], ['Английский язык', 'Физическая культура', 'Математика', 'Литеатурное чтение', 'Русский язык'], ['Русский язык', 'Окружающий мир', 'Математика', 'Труд'], ['Английский язык', 'Математика', 'Физическая культура', 'Литеатурное чтение', 'Русский язык'], ['Окружающий мир', 'Физическая культура', 'Литеатурное чтение', 'ИЗО', 'Русский язык']]
b3 = []
c3 = []

a4 = []
b4 = []
c4 = []

a5 = []
b5 = []
c5 = []

a6 = []
b6 = []
c6 = []

a7 = []
b7 = [['Русский язык', 'Информатика', 'Физическая культура', 'Физика', 'География', 'Алгебра'], ['Литература', 'Английский язык', 'История', 'Биология', 'Геометрия', 'ИЗО'], ['Музыка', 'Французский язык', 'Физика', 'Алгебра', 'История', 'Русский язык'] ,['Геометрия', 'Русский язык', 'Биология', 'ОБЖ', 'Русский язык', 'История'], ['Физическая культура', 'Французский язык', 'Труд', 'Труд', 'Английский язык', 'Литература'], ['Английский язык', 'Обществознание', 'Алгебра', 'Физическая культура', 'География']]
c7 = []

a8 = [['Физика', 'ОБЖ', 'Английский язык', 'Обществознание', 'Алгебра', 'История Санкт-Петербурга'], ['История', 'Русский язык', 'Химия', 'Французский язык', 'Алгебра'], ['Русский язык', 'Информатика', 'Английский язык', 'Физика', 'Геометрия', 'Геометрия'], ['Биология', 'География', 'Французский язык', 'ИЗО', 'Физическая культура', 'Алгебра'], ['Геометрия', 'Русский язык', 'Английский язык', 'История', 'Физическая культура'], ['Литература', 'Музыка', 'Биология', 'Литература', 'Физическая культура', 'Труд', 'Химия']]
b8 = [['Русский язык', 'Физика', 'Алгебра', 'ОБЖ', 'Обществознание', 'Английский язык'], ['Алгебра', 'Русский язык', 'История', 'География', 'Химия', 'Французский', 'Физическая культура'], ['Геометрия', 'Геометрия', 'Литература', 'Физика', 'Информатика', 'Английский язык'], ['География', 'Биология', 'Французский', 'Алгебра', 'История Санкт-Петербурга', 'Русский язык'], ['История', 'Геометрия', 'Музыка', 'Физическая культура', 'ИЗО', 'Классный час'], ['Труд', 'Английский язык', 'Литература', 'Биология', 'Химия', 'Физическая культура']]
c8 = [['ОБЖ', 'Обществознание', 'Физика', 'Алгебра', 'Английский язык', 'Русский язык'], ['Французский язык', 'История', 'Алгебра', 'Химия', 'География', 'Литература'], [ 'Физика', 'Информатика', 'Геометрия', 'Геометрия', 'Английский', 'Русский язык'], ['Физическая культура', 'Французский язык', 'Алгебра', 'Биология', 'География', 'Музыка'], ['Физическая культура', 'История', 'Геометрия', 'История Санкт-Петербурга', 'Литература', 'ИЗО'], ['Русский язык', 'Труд', 'Английский язык', 'Физическая культура', 'Биология', 'Химия']]

a9 = []
b9 = [['Обществознание', 'Литература', 'Английский язык', 'Алгебра', 'Физическая культура', 'Химия'], ['Алгебра', 'Биология', 'Русский язык', 'Геометрия', 'Французский язык', 'Физика'], ['История Санкт-Петербурга', 'История', 'Физическая культура', 'Английский язык', 'Литература', 'Русский язык'], ['Английский язык', 'Алгебра', 'Физика', 'География', 'ОБЖ', 'Литература'], ['Русский язык', 'Геометрия', 'Биология', 'История', 'Химия', 'Французский язык'], ['Физическая культура', 'Алгебра', 'Физика', 'Информатика', 'История', 'География']]
c9 = [['Алгебра', 'Английский язык', 'Обществознание', 'Химия', 'Литература', 'Физическая культура'], ['Русский язык', 'Алгебра', 'Биология', 'Французский язык', 'Физика', 'Геометрия'], ['Физическая культура', 'Литература', 'История', 'Русский язык', 'Английский язык', 'История Санкт-Петербурга'], ['ОБЖ', 'Английский язык', 'Алгебра', 'Физика', 'Литература', 'География'], ['Биология', 'Русский язык', 'Геометрия', 'Химия', 'Французский язык', 'История'], ['География', 'Физическая культура', 'Алгебра', 'История', 'Физика', 'Информатика']]

a10 = []
b10 = []
c10 = []

a11 = []
b11 = []
c11 = []


cl1 = [a1, b1, c1]
cl2 = [a2, b2, c2]
cl3 = [a3, b3, c3]
cl4 = [a4, b4, c4]
cl5 = [a5, b5, c5]
cl6 = [a6, b6, c6]
cl7 = [a7, b7, c7]
cl8 = [a8, b8, c8]
cl9 = [a9, b9, c9]
cl10 = [a10, b10]
cl11 = [a11, b11]


table = [cl1, cl2, cl3, cl4, cl5, cl6, cl7, cl8, cl9, cl10, cl11]